[
  {
    "source": "2024r Insulectro Product Line Card REDUCED SIZE 09-19-2023.pdf",
    "text": "Insulectro is the largest North American distributor for materials used in the fabrication of printed circuit boards, composite manufacturing, and the new, highly innovative printed electronics BEST-IN-CLASS technology. Keeping up with changing technologies can be a PRODUCTS challenge. Insulectro is uniquely positioned to keep its customers FROM THE WORLD’S current with cutting-edge technologies as a one-stop shop for STRONGEST BRANDS materials and intense product knowledge of these highly-engineered materials. As technology continues to evolve, manufacturers need new breakthrough products, creative designs, and a strong, dependable supply chain. Insulectro exists to help its suppliers and customers thrive. Then, now, and later. NORTH AMERICAN STOCKING LOCATIONS CALIFORNIA (S) CALIFORNIA (N) TEXAS ARIZONA Corporate Headquarters 2345 Paragon Drive 2301 Crown Ct 6615 West Boston St 20362 Windrow Drive San Jose, CA 95131 Irving, TX 75038 Chandler, AZ 85226 Lake Forest, CA 92630 products 855-995-0200 MINNESOTA COLORADO OREGON 9930 West 69th St 21303 E. 32nd Pkwy 1523 Poplar Street Eden Prairie, MN 55344 Aurora, CO 80011 Forest Grove, OR 97116 CANADA NEW HAMPSHIRE ILLINOIS UTAH 237 Finchdene Square 8 Akira Way 200 Covington Drive 809 W. 800 N. Wasatch Wrhs Unit 1 Londonderry, NH 03053 Bloomingdale, IL 60108 Logan UT 84321 Scarborough ON M1X 2E1 www.insulectro.com 949-587-3200 Enabling cu\u001fomers to build be\u001eer circuits, fa\u001fer. Printed Circuit Boards are the vital PCBs are vital for military and defense Medical electronic devices include This specialized, fast developing industry building blocks for controls, intrastructure. The need for highly reliable pacemakers, defibrillators, drug-releasing uses 5G, wireless, personal digital communications, instrumentation, and circuits is essential for weapons systems pumps, hearing aids, and diagnostic assistant, and a portable or mobile computational intelligence used in guidance, flight control, satellites, and avionics. equipment for measuring, monitoring, and computer that's used for the purpose of industrial and manufacturing systems. recording such body functions as transmitting data whether through a wired heartbeat and brain waves. or wireless network. Consumer electronics refers to the entire range of OEM-produced products containing electronic circuit Automotive electronics applications are rapidly growing. Systems include engine and battery management, power, sensors, Printed Electronics is an additive process utilizing a variety of printing methods used to create circuitry by applying conductive Cloud computing allows high-speed data analytics for complex processing allowing AI and machine learning to become a reality. Markets we serve. boards intended for personal or and Lidar for collision avoidance and inks & pastes on virtually any substrate. Also non-commercial use. autonomous driving capabilities. used in adjacent industries like construction. RESIN SYSTEMS FOR PCB LAMINATES High performance EM-827(I) - Designed for high thermal reliability with excellent CAF resistance. High Tg / CAF Resistance / Lead Free. Applicable IPC Slash Sheets: IPC-4101 /98, /99, /101, /126; IPC-4103 /250, /550. LAMINATES EMC LAMINATES EM-370(Z) - Designed for high thermal reliability with excellent CAF resistance. High Tg/High Reliability/Halogen Free. RESIN SYSTEMS FOR PCB LAMINATES products for Applicable IPC Slash Sheets: IPC-4101 /127, /128, /130; IPC-4103 /250, /550. EM-528 Multiple lamination and high thermal reliability. High Tg/High Reliability/Halogen Free. EM-827(I) EM-370(Z) EM-528 mission-critical PCBs. Applicable IPC Slash Sheets: IPC-4103 /240, /540. EM-528K Multiple lamination and high thermal reliability applications. High Tg/High Reliability/Halogen Free. Applicable IPC Slash Sheets: IPC-4103 /240, /540. EM-528K EMC laminates are designed for very complex PCBs, EM-890K(A) EM-890K(A) Designed for high thermal reliability with excellent CAF resistance. High Tg/High Reliability/Halogen Free utilizing advanced building Applicable IPC Slash Sheets: IPC 4101 /134; IPC-4103 /230, /530. blocks from ultra-thin prepregs to highly controlled cores. POLYIMIDE SYSTEMS FOR PCBS Examples of applications 85N (High Temperture) - a 2500C high glass transition pure polyimide resin system that provides superior thermal resistance to high-temperature end-use electronics. include “Any-layer” PCBs, mSAP, Meets requirements of IPC-4101/41. POLYIMIDES SYSTEMS FOR IC substrate, high layer count 85HP (High Performance)- best-in-class 2500C high glass transition temperature polyimide resin system available PCBS Validated to three IPC-4101 slash sheets 40, 41, & 43. (HLC)/ high speed digital (HSD) 86HP (High Performance) - revolutionary addition to Arlon’s best-in-class high performance polyimide laminate 85N (High Temperture) ARLON POLYIMIDES 85HP (High Performance) and radio frequency (RF). systems engineered to meet high temperature, electrical, and mechanical performance. Meets IPC-4101 slash sheets 40, 41, and 43. POLYIMIDES 86HP (High Performance) Arlon specializes in Polyimide, PREPREGS FOR RIGID-FLEX AND CAVITY PCBS PREPREGS FOR RIGID-FLEX & 37N (Low Flow Prepreg) - a 2000C glass transition temperature polyimide low-flow resin system designed for bonding CAVITY PCBS Low Flow, and CTE-controlled multilayer rigid flex, heat sink attachment to MLBs 37N (Low Flow Prepreg) PCB products. Meets requirements of IPC-4101/42. 38N (2nd Gen Low-Flow 38N (2nd Gen Low-Flow Polyimide Prepreg) - Second-generation 2000C glass transition temperature polyimide Polyimide Prepreg) Arlon is recognized for the low-flow resin system designed to improve adhesion and bond strength to Kapton® polyimide films, copper and others. 49N (Multifunctional Epoxy highest quality standards in the Meets requirements of IPC-4101/42. Low-Flow Prepreg) 49N (Multifunctional Epoxy Low-Flow Prepreg) - low-flow epoxy prepreg engineered for bonding multilayer epoxy industry and is positioned to support our customers most rigid-flex or attaching heat-sinks to multilayer epoxy PCBs. 51N (Lead-Free Epoxy Low-Flow Prepreg) technological challenges through innovating Meets requirements of IPC-4101/26. 51N (Lead-Free Epoxy Low-Flow Prepreg) - non-DICY multifunctional epoxy low-flow prepreg system designed to technologies. provide high reliability through lead-free solder operations. Meets requirements of IPC-4101/126. THE PYRALUX® FAMILY Pyralux® AP All polyimide double-sided copper clad laminate for high reliability flex and multilayer flex circuitry. PYRALUX® FLEXIBLE Pyralux® AG All polyimide double-sided copper clad laminate offered in rolls and sheets for commercial, wireless, or automotive designs. CIRCUIT MATERIALS Pyralux® HP HP is the newest adhesive to the Pyralux® line up. It is low-loss epoxy based adhesive that is ideal for any situation where signal integrity is a driving PYRALUX® AP DuPont offers a comprehensive, industry-leading portfolio of factor in the design. PYRALUX® AG Pyralux® flexible circuit materials and systems designed to meet Pyralux® AC An all polyimide single-sided copper clad laminate ideal for applications that PYRALUX® HP today's and the next generation’s design challenges. require thin, light, high density circuitry along with chip-on-flex attachment FLEXIBLE LAMINATES PYRALUX® AC Pyralux® HT Copper clad laminate and bonding system for high temperature and high PYRALUX® HT The Pyralux® portfolio includes a diverse collection of core performance flex and multilayer flex circuitry PYRALUX® TK dielectric materials and customized dimensional constructions that Pyralux® TK Featuring a unique Kapton® Polyimide and Fluoropolymer film base dielectric PYRALUX® LF enable the designer and manufacturer of complex circuits to double-sided copper clad laminate and bondply ideal for high speed digital and PYRALUX® FR deliver high performance solutions. DuPont Pyralux® copper clad high frequency flexible circuit applications PYRALUX® APR laminates, bondplys, coverlays, and adhesive systems offer Pyralux® LF Acrylic-based copper clad laminates, coverlays, bondplys and sheet adhesives excellent functional performance and high reliability and allow for that have been the industry standard in high reliability applications in the consumer electronics industry for over 35 years. the fabrication of thin, solderable, high density electrical interconnects for single and double-sided, multilayer flex and rigid Pyralux® FR Acrylic-based flame retardant copper clad laminates, coverlays, bondplys and sheet adhesives for products requiring UL rating flex applications. Pyralux® APR An all polyimide double-sided resistor laminate where reliable resistor technology, temperature tolerance, and robust processing are required RISTON® DRY FILM PHOTORESIST Riston® Direct Image Series of direct imaging photoresists designed for optimum high performance on dual band exposure equipment for print-and-etch and plating applications. This film series offers improved adhesion as well as resolution below 1 mil. RISTON®DIRECT IMAGE DRY FILM PHOTORESIST Riston® Laser Series Specialty product for laser direct imaging possessing ultra-high photospeed. RISTON® LASER SERIES RISTON® SPECIAL FX RISTON® DRY FILM Riston® Special FX Series of photoresists providing high resolution capabilities. RISTON® MULTIMASTER PHOTORESIST MATERIALS Riston® MultiMaster Series of general purpose photoresists with alkaline etch and gold plating capabilities. RISTON® ETCHMASTER DuPont™ Riston® dry film photoresist revolutionized the way printed RISTON® GOLDMASTER circuit boards were fabricated when it was invented by DuPont over RISTON® PLATEMASTER Riston® EtchMaster Series of photoresists giving high productivity/high resolution in acid print-and-etch and forty years ago. Fabricators challenged to produce denser and more chemical milling. RISTON® TENTMASTER complex boards choose DuPont for improved product and process YIELDMASTER® 2000 solutions that keep them both competitive and profitable. Explore the Riston® GoldMaster Thick plating resist (75 and 100 micron) for selective or pattern Ni/Au plating. Riston® line of high performance dry film photoresists for your next PCB application. Riston® PlateMaster Cu/Sn, Cu/SnPb plating film providing plated line uniformity, fine line resolution, and wide surface tolerance on direct metal, panel plate and electroless surfaces. Riston® TentMaster Film giving good conformation and reliable performance in tent-and-etch as well as acid print-and-etch. YieldMaster® 2000 The YieldMaster® 2000 Wet Lamination System for cut-sheet and hot-roll laminators. Fineline imaging with Riston® Wet Lamination System This system provides enhanced yields without loss of productivity. Innovative Thin Copper MEET INTERRA™ Clad Laminates Push Interra™ HK04 Electrical Boundaries DuPont™ Interra™ embedded planar capacitor laminate is used in making thinner, more INTERRA™ HK04 DuPont™ Interra™ efficient power and ground planes within a thin copper clad multilayer printed wiring board. It provides very laminates are low impedance at high frequency, power bus specifically decoupling, and electromagnetic interference designed for use in reduction. Interra™ HK04 saves PWB cost by THIN COPPER CLAD multilayer rigid replacing SMT by-pass capacitors, their PTHs printed circuit and associated costs. Interra™ HK04 is a boards. rugged polyimide dielectric laminate that can be All Interra™ thin processed similar to thin flexible circuit laminate copper clad laminates utilize low-profile electrodeposited (ED) copper through the develop/etch/strip process steps. laminated to thin polyimide based dielectric. This dielectric is The HK04 dielectric is flexible and can be engineered to have superior adhesion to copper than traditional imaged and etched to remove copper on both glass-reinforced materials utilized in rigid boards. sides of the dielectric at the same time. HK04 provides high reliability through PWB processing The polyimide dielectric is based on DuPont™ Kapton® technology, and in extreme PWB conditions (ex: the Mars but is specifically engineered to have low dielectric loss, high dielectric Rover). DuPont™ Interra™ embedded planar isolation and strength, and tight thickness tolerance which are capacitor laminate is available with two different inherent benefits compared to traditional rigid circuit board materials. base polyimide films. PACOTHANE® LAMINATION ASSIST PACOTHANE® is a high temperature-resistant Release Film specifically engineered for laminating rigid, flexible and exotic substrate Printed Circuit Boards. It is manufactured in-house under a patented process, with stringent quality controls. PACOPADS® are a line of press pads specifically engineered to improve the process of laminating rigid multi-layer and flexible Printed Circuit Boards. They serve two primary functions: to accurately control heat input and to equalize the pressure applied to the panel surface. Innovative TRIPAK® is a Pacothane-clad press pad that is specifically engineered to control the variables associated with the lamination process of Printed Circuit Boards. TRIPAK’s primary function is to deliver consistent, repeatable heat rise, equalize applied pressure and economically incorporate the benefits of Pacothane release film to the processing solutions lamination process. PACOTHANE® PACOPADS® PACOGARD® Panel Separator or \"Slip\" Sheets are a line of proprietary, process-enhancement products specifically engineered to protect both inner & outerlayer PCB Panels from scrap resulting from handling TRIPAK® damage, excessive oxidation and airborne particulates. PACOGARD also significantly reduces \"False Alarms\" at Pacothane services the worldwide PCB PACOGARD® AOI. market, which includes rigid multilayer, PACOCLUTCH™ PACOCLUTCH™ is a two-side releasable film, engineered specifically for use by PCB Multilayer manufacturers that PACOVIA rigid/flex, cover-layer flex, flexible laminate etched copper laminate cores, in place of copper foil in the outer layer lamination process. PACOTHANE® PLUS multilayer, copper and unclad PACOVIA Two-Component System (PACOVIA and PACOPADS®) is a performance-driven line of PACOFLEX™ ULTRA laminates. These circuit boards are high-temperature, resin-blocking release films. The PACOVIA System is specifically engineered to enhance FILMS & PADS THERMOPADS™ integrated into a wide variety of sequential lamination of buried and blind via designed rigid Printed Circuit Boards. THERMOFILM™ applications and markets that include PACOTHANE® PLUS is a conformable Release Sheet that is specifically engineered for use as a component of the PACOQUICKPRESS™ Pacothane® Plus System for the production of flexible Printed Circuits (base stock, coverlay, and rigid-flex). telecom, data communications, Pacothane® Plus brings COPPER FOIL standardization and predictability to the flex laminating process and offers tangible high-speed computing, mobile devices, process advantages. COPPER FOIL military, smart cards, medical and effectively all electronic PACOFLEX™ ULTRA is specifically engineered for the lamination of coverlayers to flexible Printed Circuit Boards. products. This product is a robust highly conformable release film which, when exposed to heat and pressure, becomes extremely soft and pliable for superior conformance to intricate flex part topographies. THERMOPADS™ comformable press pads for extreme temperature usage THERMOFILM™ easy release film for extreme temperature usage PACOQUICKPRESS™ two-sided release film engineered for high temperature quick press PCB laminations TM Drill ENTRY a better S U P E R I OR Tightest Hole Location • Thickness: 0.22mm ±0.025mm Minimized Drill Deflection • Surface hardness: >50 shore “D” ENTRY One Product for All Drill Sizes • Non-conductive hole. BULLSEYE ™ Increased Drilling Capacity • Engineered Aluminum Alloy BULLSEYE ™ BLU EO+ ™ PHENOLIC Accuracy. . . Efficiency. . . Reliability. . . blu BULLSEYE REGISTRATION SHEET ™ Non-contaminating Minimized burring Maximum Efficiency Proven Accuracy • Thickness: 0.25mm ±0.025mm • Surface hardness: >50 shore “D” • Non-conductive • Engineered Aluminum Alloy BACKUP LCOA™ designs, develops, and • Thickness: 0.305mm ±0.038mm D R I L L I N G Minimized burring Increased hole quality • Surface hardness: >50 shore “D” SLICKBACK ™ manufactures precision quality backup Reduced drill temperature • Conductive SPECTRUM ™ GOLD PLUS and entry solutions used in the Predictable performance • Engineered Aluminum Alloy manufacturing of printed circuits boards. BACKUP & ENTRY POLARBACK ™ CONFORMAT ™ LCOA™ has been located in Southern BACKUP Extended Tool Life • Thickness: 2.44mm ±0.127mm PHENOLIC California since its inception and has ® Increased Stack Height • Density: > 830 kg/m³ become the North American leader in Lubricated Drill Backup Best Hole Quality • Surface hardness: > 75 shore “D” P ROD U C TS backup and entry sales while also selling Increased Throughput • Lubricated paper on HDF core products on five continents and in over Minimized Burring • Thickness: 2.41mm ±0.127mm 15 countries around the world. Increased Hole Quality • Density: > 830 kg/m³ Reduced Drilling Temperatures • Surface hardness: > 75 shore “D” Today, LCOA™ supplies drilling solutions Greater Return on Investment • Non-lubricated paper on HDF core to many of the largest PCB Improved hole quality • Thickness: 2.50mm ±0.15mm manufacturers in the world. No phenolic resins • Density: > 830 kg/m³ Designed for drilling PCBs • Surface hardness: >80 shore “D” LCOA™ is the technological leader for Prevention of burrs • Melamine coated on HDF core backup and entry – all to help drill a Prevention of burrs on panels with better hole. image transfer Minimizes rework Clean & Increased lamination throughout – Using CSC™ panels which are 7.5 times thinner than traditional steel separator plates supports more panels per press opening. Easy ® In addition to offering consistent CTE within the press stack with image transfer reduction benefits and single operator breakdown benefits too. INC CAC Inc, is a domestic ® Less material handling – In conventional pin lamination of a ten-high book, 31 individual manufacturer of CAC™ copper foil and aluminum separator components must be carefully placed over pins in the and CSC™ products. lay-up of a multilayer book. CAC™ reduces the number of components that must be COPPER-ALUMINUM-COPPER (CAC™) handled to 11, for a 65% reduction. These products support COPPER-STEEL-COPPER (CSC™) established copper foils ADVANTAGES DUOFOIL (Release Coated Aluminum) Reduced operator labor – In the same ten-high lay-up, operators must wipe 40 surfaces down to 6µ and new to ensure the best possible surface cleanliness. Because CAC™ delivers pre-sealed from the emerging foils with low factory, operator wiping of critical surfaces is no longer necessary. The combined LAMINATION ASSIST productivity gains are typically 30% to 50%. to very-low profile treatments. Elimination of foil wrinkles – Handling and registration of thin copper foil onto lamination They can be attached to one or both sides of a steel or aluminum fixture pins can cause handling wrinkles, a major source of foil pinholes. Another source of carrier, supporting the lamination department. foil wrinkles, thermal expansion mismatch between copper foil and steel separators, is Providing superior panel surface quality, mitigating foreign object or eliminated by the use of aluminum separators. debris concerns, improve layup efficiencies and supporting press COPPER Improved thermal conductivity – the use of CAC™ can reduce inherent temperature stack coefficient of thermal expansion. COPPER CORE differences in a lamination book due to its improved thermal conductivity as compared to steel separators. COPPER COPPER FOIL CORE ALUMINUM OR STEEL COPPER FOIL Technology that DRILLS extends tool life and ENDMILLS reduces drilling cost. DRILLS ROUTERS ROUTERS SCORING/ENGRAVING Kyocera provides tools designed Kyocera provides a full range of COUNTERSINKS specifically for controlled depth, thick router designs for internal and panels for both through hole and external routing, including specialty REPOINT back drilling. tools for gold tab and for brittle materials prone to fracturing. DRILS, ENDMILLS, ROUTERS Kyocera Precision Tools designs and manufactures tight tolerance precision carbide cutting tools for PCB applica- tions. Products include drills, routers, end mills, and special- ENDMILLS ized cutting tools ranging from 0.05mm to 6.70mm diame- Kyocera provides a range of End Mills ters (0.0020\" - 0.2638\"). from single to four flute optimized for REPOINT Kyocera Precision Tools' products are manufactured with the processing the full range of materials Kyocera has long been an industry leader in finest carbide grades available. Their product development used in printed circuit boards, repointing delivering superior quality with excellent including specialty designs for rigid turn times to support their customer base. Recent laboratory continually evaluates new materials from carbide and rigid flex. investments in additional automated re-point manufacturers around the world. As a result, Kyocera equipment ensure customers are receiving precisely applies the latest developments in material science to the repointed tools for optimum hole wall quality. design and manufacture of precision cutting tools. Kyocera Precision Tools is also a world leader in the area of drill sharpening and tool management services. We supply and support the best advanced materials for PCB fabricators & OEMs who demand speed & technology. The electronics industry is structured on high-performance, Patrick Redfern cross-functional teams PRESIDENT & CEO across the entire supply chain. Suppliers, distributors, fabricators, designers, and OEMs rely on the continual ﬂow of new technology and the requisite materials to TEAM MATTERS meet the demands of a wired and wireless world. We Enable Our The Insulectro Team is Customers To Build committed to delivering the best materials possible, Better Circuits, FASTER as quickly as possible, using the easiest process possible. EMC · ARLON · DUPONT · LCOA · CAC · PACOTHANE · INDUBOND · ORMET · DENKAI AMERICA · FOCUSTECH · JX METALS · TADCO · SHIKOKU · KYOCERA · IBC · SHUR-LOC · ETI HIGH SPEED / LOW LOSS FOILS Electrodeposited SEED High peel strength, very low provide – PTFE and Flex applications Copper Foil HIGH SPEED / LOW LOSS • SEED • HL HL Next generation in low profile – high speed multilayer designs • EPS Denkai electrodeposited copper foil is recognized as a leader in EPS “No profile” foil – signal critical layers on advanced thermoset resin systems CONVENTIONAL reliability and technology leadership. With the strength of both • TOB-III • MHT domestic and international development and manufacturing, our CONVENTIONAL FOILS • HP2 goal is to solve the most challenging problems though collaboration and perseverance. TOB-III Standard and low profile options – for all modified epoxy resins At Denkai America, copper MHT High lamination temperature compatible – PTFE and PI materials foils are electroformed on HP2 Modified for improved bonding – designed for outer layer applications revolving titanium drums, unique for the ability to deposit copper foils with a high-quality surface. Electroformed foils are then subjected to a variety of surface treating operations contingent upon end-use requirements. COPPER FOILS Low-Profile Electrodeposited Copper Foil - Copper Foils Electrodeposited ELECTRODEPOSITED COPPER FOIL TREATED ROLLED COPPER FOIL JX Nippon’s electrodeposited foils have low-profiles to support fine Mitsui Mining & Smelting offers electrodeposited copper foils for general purpose to JTCS-P1 ARSENIC-FREE VLP FOILS line application. high end design applications. JXEFL RTF VLP FOILS They can incorporate various surface treatment options, with fine Their carrier foils known as MicroThin utilize an 18 µm carrier to support many market HA-V2 VLP FOILS nodulations and low surface roughness. Designed for high peel segments such as the Semiconductor Packaging and HD Interconnects. Which require strength and excellent thermal resistance to support various dielectric suitable copper foils for fine circuit designs to achieve smaller and thinner devices. COPPER FOILS materials. JTCS-P1: High temperature elongation foil which is Arsenic free and These Grade 1 foils are suitable for fine pitch patterns with lines and spaces of less than reduced Zinc chemistry for design and manufacturing purposes. 35 µm for manufacturing techniques such as mSAP. ELECTRODEPOSITED COPPER FOIL Applications include High Density Interconnects (HDI) boards, IC MT18EX 18µm GRADE 1 FOILS package substrates and Multi-layer printed circuit boards. MT18FL 18µm MT18Ex 18µm carrier foil with a 3 µm or 5µm Electrodeposited foil, with a JXEFL: Annealable copper foil with high-elongation and class profile Rz of 2 µm regardless of thickness. leading bendability available in various thicknesses and surface MT18FL 18µm carrier foil with a 1.5 µm Electrodeposited foil, with a profile Rz of 1.3 µm regardless of thickness. treatments. Applications include High Frequency designs, Flexible printed circuits. The PROCESS CHEMICALS Best Teams have great PROCESS CONTROL SYSTEMS CUSTOM CHEMICALS FORMULATIONS CUSTOM CONTROLLER DESIGNS chemistry. TECHNICAL SUPPORT Process Chemicals PROCESS CHEMICALS TOLL BLENDING Inner Layer PreClean Processes Develop-Etch-Resist Strip for IL Dry Film Processes Inner Layer Bonding Process We supply process chemicals and control solutions to Strip-Etch-Strip for OL Dry Film Processes printed circuit board fabrication and chemical milling Copper Microetches operations. These chemicals are tailored to work Cupric Chloride and Ferric Chloride Etching effectively with DuPont and other dry film products. Antifoams Waste Treatment FOCUSTECH™ has a well-established stable of existing products but also prides itself in being able to quickly and Process Control Systems (In-house Design, Fabrication and Support) effectively formulate custom products for customer specific Developer Resist Stripper applications. Insulectro and FOCUSTECH™ are your team Tin Stripper for reliable, high quality process chemicals, control Cupric and Ferric Etching solutions and product support. Copper Cleaning & Etching Waste Treatment Custom Designs Innovative metallization DISCOVER DUPONT CHEMISTRY technologies across many ELECTROPLATING APPLICATIONS CHEMISTRY HDI: platforms HDI Microfill™ EVF-III for advanced via filling and through-hole plating Microfill™ EVF-III The addition of the DuPont Electronics Imaging & Interconnect Microfill™ LVF-IV for next generation SLP applications Microfill™ LVF-IV Solutions (ICS) chemistry line, which includes former legacy Dow MLB chemicals, adds a complimentary piece to an already robust Copper Gleam™ PPR-II for high aspect ratio pulse plating MLB: Electroposit™ EP-1600 for high aspect ratio DC plating Copper Gleam™ PPR-II Insulectro product offering in chemistry. Copper Gleam™ HS-200 for horizontal DC plating in FPC applications Electroposit™ EP-1600 Copper Gleam™ ST-920 for DC vertical continuous plating (VCP) This addition now provides chemistry and technical support to the Copper Gleam™ HS-200 general metal finishing, plating-on-plastics, and wire-plating IC Package Substrate Copper Gleam™ ST-920 Microfill™ SFP-II & Microfill™ LVF-IV for advanced SAP applications IC PACKAGE SUBSTRATE industries - a symbol of our commitment to chemistry. Microfill™ SFP-II MAKING HOLES CONDUCTIVE We deliver tutorial programs to engineering, quality, and Electroless Copper Solutions Microfill™ LVF-IV production teams both at customer sites as well as virtually. These Circuposit™ 3350-1 Vertical Electroless Copper ELECTROLESS COPPER SOLUTIONS Circuposit™ 4000 Horizontal electroless copper for FPC/RFPC collaborative engagements are tailored specific to the application Circuposit™ 3350-1 Circuposit™ 6700 Horizontal Ionic Catalyst for Advanced HDI applications Circuposit™ 4000 and the audience, including both well-established DuPont CHEMISTRY Direct Metallization Solutions Circuposit™ 6700 chemistry processes and new technologies being developed and Next Generation Crimson™ & Conductron™ palladium-based systems DIRECT METALLIZATION SOLUTIONS: introduced into the North American market. Next Generation Graphite 2000™ carbon-based system Crimson™ ENIG Conductron™ Duraposit™ SMT-88 & Aurolectroless™ SMT 520 ENIG: Process Chemistries Duraposit™ SMT-88 DuPont offers a full line of cleaners, developers, strippers and other ancillary products to support printed circuit Aurolectroless™ SMT 520 applications. PROCESS CHEMISTRIES General Metal Finishing GENERAL METAL FINISHING Full line engineering, decorative and precious metal offerings Organic Solderability Preservatives OSP & ADVANCED PRETREATMENTS WHY OSP: • OSP process is lower cost than HASL and the other metal finishes • OSP process is environmentally friendly (VOC free, etc.) • OSP film is available for lead free solder application • Good solder joint strength compared to Ni/Au plating Glicoat-SMD F2(LX) For lead free solder and selective gold. GLICOAT-SMD F2(LX) Good performance on the selective gold boards, due to no deposit of OSP film on gold pads. GLIBRITE GB-4300 It is very suitable for mobile phone, memory boards . GLICAP Advanced Pretreatments Glibrite GB-4300 Trailblazing technology Gilbrite GB-4300 is a sulfuric-peroxide copper roughening solution to promote adhesion of Dry film and solder mask resists. Shikoku Chemicals Corporation manufactures and sells An economical and environmentally-friendly solution due to low and consistent etching chemistry providing excellent adhesion as compared to conventional microetch processes. chemical products and housing materials in Japan and Advantages: internationally. Its product portfolio includes inorganic • Excellent adhesion with less etching (10-15 min) chemicals, organic chemicals, advanced and specialty • Suitable for super fine copper circuit and higher signal integrity, due to lower roughness chemicals, electronic chemicals comprising organic • Good stability in high copper concentration achieves lower running cost solderability preservative and microetching solutions, and • Uniform appearance with typical Etching amount 0.2 - 0.6 µm advanced and specialty chemicals. GliCap Newly developed non-etch adhesion promoter composed of azole derivative, which Shikoku OSP (Organic Solderability Preservative) is the most popular has expertise from synthesizing for their OSP product. final surface finish for PCBs. OSP film has excellent humidity Advantages: • Very thin organic film deposited only on copper surface via vertical/horizontal wet process line resistance to protect copper oxidation. • No etching/change in topography of copper surface, beneficial for high frequency applications • Strong chemical bonding between copper and resin • No additional special copper surface preparation such as Tin • Compatibility with wide range of resin systems LAMINATION, REGISTRATION, & AUTOMATION MEET INDUBOND® Induction bonding RFX X-PRESS technology. X-PRESS A better way. . . Finally. for Lamination RFX for Registration InduBond® has long been respected for tight accuracy in 230N registration, its lamination presses, automation (automatic for Bonding loading/unloading), and its eco-friendly best practices. InduBond® X-PRESS lamination presses utilize a different way of producing the heat required for lamination using standard pressing methods. The innovation of this technology is that it produces heat on the laminated material, and only the laminated material, of each layer of the press pack at the same time, at the same temperature level, without any thermal conduction. X-PRESS - Inductive heating is the revolutionary new way of PCB laminates RFX - High-precision (<10 microns) layer-to-layer 230N registration 230N - Next-generation inductive bonding machine ORMET® SINTERING PASTE ORMETT SINTERING PASTE ® Ormet® pastes are lead-free, highly electrically and thermally conductive, and provide good solderability at relatively low temperatures. During the curing process, the material forms a solid metal, alloying with the paste don’t plate copper circuits in the Z-axis. This forms a metallurgical bond stronger than mere contact. Once completed, the sintered metal will not re-flow until temperatures of 800°F. A solid, CONDUCTIVE PASTE High Density Interconnects (HDI) in PCBs have traditionally been made using electroplating. However, intermetallic advanced requirements in ball grid array density, high PCB layer counts, and fine diameter vias have bond created the need for paste solutions. Because the PCB layers connected by paste may be tested individually, as opposed to the sequential electroplating process that can only be tested in its final form, overall yields Use Ormet® Sintering Paste in are significantly improved. Also, the Ormet® process requires a substantially lower capital investment than PCBs to form High Density expensive plating lines and water treatment facilities and is much more environmentally friendly. Interconnects in a fraction of the time it takes to plate. Imagine how fast you could PASTE Ormet® pastes make cycle make your boards if you DON’T didnʼt have to plate. time reduction and high-end PLATE TM performances possible in any PCB shop. Design Let Insulectro Assist Correct Material Your Design Efforts INSULECTRO Selection Education & Utilization With its unmatched reputation for supplying PCB manufacturers DFS – Design for Solvability MATERIAL RECOMMENDATIONS Best-in-Class materials from World-Class Suppliers, Insulectro again HDI Routing & Packaging At Insulectro, SPEEDY REGIONAL MATERIAL we will dedicate our efforts, ourwithknowledge, and ouroffering – Design Education PCB DESIGN EDUCATION innovates another breakthrough DFP – Design for Performance resources to help shape the direction AVAILABILITY of Services. our industry. Signal Integrity HSD, RF & PDN STACK-UP SUGGESTIONS: HDI, RF, FLEX, To partner RIGID-FLEX, SI &with DFX our customers, we are laser-focused Recognizing on doing the need for exacting PCB and PE design, Insulectro DFM – Design for Manufacturability whatever it takes, understanding that a “one size fits all” offers its fabricator and OEM sales and design audits and guidance. customers Material, Feature Size, & Process DESIGN REVIEWS operations approach is a non-fit for everyone. MANUFACTURING INTERFACE Paired with new, vibrant Educational Service offerings, Insulectro DESIGNWe offer you LAYOUT our best-of-range products, OUTSOURCE world-class ensures that suppliers, game-changing materials match-up with your optimized Why Materials Are Important customer service, and our technical knowledge to strengthen your Availability designs. • PumaFAST™ - Off the shelf materials business. Insulectro’s industry • Shorter lead times • Select industry standard constructions experience generates Because at the end of the day, it’s credibility for design Today’s Designer must meet 3 Perspectives for Success Design For: Manufacturability all about trust. A skill set to solve the place and • DFSolvability 1 route of all parts and connections. Often with complex High Density • Process friendly expertise. By • DFPerformance Interconnect (HDI) and to master • DFManufactuability Layout Solvability this on your CAD system • Isola materials process similarly to FR4 streamlining the process Signal (SI) & Power (PI) Making Revision DFX considerations • Lower cost of manufacturing producing high yield and • High range of technical performance Integrity, EMC, Thermal 2 One 3 and utilizing our Meeting all performance Requirements Performance Work Manufacturability lower cost for: Fabrication, Assembly, Test, Compliance, Reliability… industry knowledge of Technical Support materials and THE RESULT Maximum placement and routing density, optimum electrical performance and efficient, defect-free manufacturing • FAEs located throughout the country • Optimize Technical Performance fabrication, customers • Design and Education support can bring their boards to market faster and more cost effectively. GIVE YOUR PROBLEMS THE BRUSH-OFF Over 100 years of brush design and manufacture PUMICE SCRUBBING BRUSHES Industrial Brush Corporation (IBC) has roots that can be traced back to DEBURRING BRUSHES 1896. Circuit board brushes feature aluminum construction for maximum CLEANING BRUSHES durability without excess weight. The spiral-wound design permanently locks brush filaments into a channel to prevent filament loss. Brushes are precision trimmed to maintain uniform surface finishes. To meet the increasing surface preparation requirements of the PCB industry, IBC offers the complete range of impregnated nylon filament in grit sizes from 180 to 500. Bristle for Deburring: Brushes with grits of 180, 240 and 320 quickly and effectively remove drilled hole burrs. The self-cleaning action of these brushes preserves the integrity of the hole. Our Service Program can tie in brush Bristle for Scrubbing: Brushes with grits of 320, 500 and 600 are BRUSHES ideal for heavy scrubbing and cleaning. Typical applications include copper scrubbing, tin lead cleaning, oxidation removal, and surface preparation for resist adhesion. changes for proper preventative Light-Duty Cleaning Non-abrasive nylon filament brushes are available for maintenance. light-duty or final cleaning. Printed PRINTED Electronics DEFENSE ELECTRONICS Markets One Stop Shop CONDUCTIVE INKS More and more disparate markets are ADVANCED SUBSTRATES AEROSPACE AUTOMOTIVE relying on printed electronics for For Printed Electronics CONVERTING & TOLLING SERVICES thinness, reliability, and ease of PRINTED ELECTRONICS TECHNICAL SERVICES manufacture. for: The dynamics of Printed Electronics is changing. Printed electronics offer designers a MEMBRANE SWITCH Keeping up is a full-time job. Count on Insulectro to wide variety of options and attractive WEARABLE ELECTRONICS keep you current with cutting-edge technologies and economics, helping to put electronics CAPACITIVE SWITCH our one-stop-shop of innovative materials from TRANSPORTATION INDUSTRIAL TOUCH SCREEN everywhere. best-in-class suppliers. CONTROL PANELS Insulectro is committed to help BIOMEDICAL SENSORS These products, and our unparalleled technical FORCE-SENSING RESISTORS pioneer this new frontier of future MEDICAL support and customer service, assure our customers IN-MOLD ELECTRONICS circuits. that Insulectro is watching out for your needs. PTC HEATERS PCB WIRE WRAPPING RELEASE LINERS KEY ANTENNAS SUPPLIERS BATTERIES/EVs PRECISION LAMINATION TOOLS TOOLING & SEPARATOR PLATES LAMINATION PLATES PRECISION PIN & BUSHING HIGH PERFORMANCE RELEASE AGENT PIN CLEANER, BUSHING BRUSHES, Finest Tooling for AND INSPECTION TOOL Lamination Available ACCESSORIES Precision Pin & Bushing for higher registration TADCO's strict adherence to quality standards and exclusive High performance release agent for eliminating resin use of custom alloys makes a world of difference when residue producing tough multilayer PCBs. Every order of tooling plates Pin cleaner, Bushing comes with a coordinate Measuring Machine Report and brushes, and inspection Certificate of Compliance traceable to MIL standards. tool In addition, TADCO can manufacture Lamination and Transport Plates for any press system; both manual and automatic load and unload. TADCO's specialized knowledge of the PCB lamination processes as well as metallurgical and heat treating sciences combined with highly graded steel alloys allows us to produce the finest tooling available today. PREVENTIVE MAINTENANCE PROGRAM With 20 years of experience, we take EQUIPMENT machine rebuilds seriously! REBUILDS & INSTALLATIONS SERVICE The calls for Preventative Maintenance Programs and Equipment Rebuilds are increasing as customers understand the benefits this brings to their equipment’s overall performance and up time. Many of you are excited to hear we can help fill this gap in Technical Support. It is sometimes difficult to see a machine’s degradation over time and it’s lack in performance can result in product/process issues Breathing New Life into Worn Machines that can be difficult to identify. We can provide the following services to ensure your equipment is running at its optimal level. Result: more equipment up time. We can assist in your equipment needs through the following: • Equipment Reviews and Audits • Service and support • Preventative Maintenance Programs Also, do you have a used piece of equipment you’re looking to get installed? We may be able to assist here as well! When it comes to screen tension, it canʼt be A SCREEN SYSTEM THAT WORKS too much or too little The shur-loc® Difference When it comes to screen tension…..too little is not good and too • Mesh panels that are ready to stretch into the FABRIC SYSTEM a division of JSMD Key Products LLC much is not good either! Through extensive testing, shur-loc® has Shur-loc frame in minutes mastered the optimal tension when screening soldermask on • Each mesh panel has a color-coded edge as SCREEN TENSION SYSTEM SHUR-LOC® E-Z XL STRETCHER automatic screen printers. well as the information stamped in one SHUR-LOC® E-Z 2.0 SERIES FRAMES corner Too little of mesh tension will allow the mesh to move under the • Available in the common 22.5 degree angle SHUR-LOC® E-Z 2.0FABRIC PANELS squeegee causing soldermask to flow into the holes. It will also needed for LPI or 90 degree cause the mesh to retract very slowly off the surface of the panel. Too much tension could cause the squeegee to flex shur-loc® can custom fit all during printing and leave a most any size frame to your heavier deposit on the outside application edges of the panel. Not to • Ease of use, anyone can learn to stretch a mention the extra mechanical frame stress needed from the • Continuous consistent tension throughout machines mechanical system. the frame shur-loc® and experienced • Frames can be stretched in a matter of minutes screening department • Ready for immediate use. No more leaving supervisors have pinpointed frames/mesh to settle out for hours and the optimal tension so you get then having to retension before use the best performance across the board."
  },
  {
    "source": "isola-group_product_guide-2025-b-web-.pdf",
    "text": "2025 PRODUCT GUIDE HIGH PERFORMANCE LAMINATE & PREPREG MATERIALS FOR PCB MANUFACTURING 1 isola-group.com CONTENTS The highest quality raw mate- rials, supported by truly global, holistic teams of professionals. Isola products are The Base for MARKETS MARKETS ATTRIBUTES Innovation®, and it’s our goal to foster breakthroughs that GLOBAL HEADQUARTERS, CHANDLER AZ make a difference every day. 06 20 COMPANY OVERVIEW Isola is a leader in global material sciences. We design, develop, manufacture, and qualify copper-clad HIGH SPEED LAMINATE laminates and dielectric prepregs used to fabricate multilayer printed circuit boards (PCBs). DIGITAL & PREPREG PRODUCTS GUIDE GLOBAL PRESENCE 14 21 Isola has manufacturing, research and development, technical support and sales teams across Asia, Europe, and the United States. Why is that important? It allows us to service customers all around the world from start to finish. Knowledge sharing and collaboration is at the heart of our values, and our global RADIO FREQUENCY LAMINATE teams work closely together to deliver our very best solutions, every single time. & MICROWAVE & PREPREG PRODUCTS DATA 17 23 OUR Enable innovation and technology with valued products, services, and technological solutions MISSION HIGH THERMAL GLOBAL developed through a deep understanding RELIABILITY NETWORK of customer needs and investments in a PRODUCTS highly talented, committed and motivated workforce. 2 3 isola-group.com MARKETS ATTRIBUTES Dive into the markets we’ve served the most and We possess an extensive portfolio of patent and see how we address the priorities of customers in other intellectual property rights covering our vastly different worlds with the same consistent, proprietary resin formulations, and have pioneered high-performing products, vetted and tested the development of several product categories before they ever leave our facilities. with ‘‘best in class’’ technology. 5G NETWORKING & COMMUNICATION APPLICATIONS Isola 5G materials are designed Isola helps connect the world with for low moisture uptake and stable highly reliable and thermally robust electrical performance across a materials. wide range of temperatures to handle anticipated environmental conditions. RADIO FREQUENCY AUTOMOTIVE AEROSPACE HIGH SPEED HIGH THERMAL HIGH DENSITY & MICROWAVE & TRANSPORTATION & DEFENSE DIGITAL (HSD) RELIABILITY INTERCONNECT (HDI) Isola helps designers achieve Isola drives innovation into Isola offers high reliability and Isola offers a wide range of HSD Isola offers several products HDI attributes are PCB designs that smaller, more powerful and automobile, railway and aircraft superior performance laminate materials that deliver superior with different levels of electrical employ increased feature density electronics with thermally reliable performance and CAF resistance. performance that all possess to achieve lighter weight, reduced durable and less power hungry materials for extreme conditions laminate materials. excellent thermal reliability. layer count, and thinner stack ups. products. COMPUTING, STORAGE MEDICAL, INDUSTRIAL CONSUMER HALOGEN HIGH RADIO FREQUENCY & PERIPHERALS & INSTRUMENTATION ELECTRONICS FREE TEMPERATURE & MICROWAVE Isola’s high-speed digital materials Isola’s materials help cost savings Isola’s materials help put the Isola offers a variety of non- Isola offers materials designed Today’s designers are challenged are the base for the internet of for today’s advanced electronics. consumer in control of their halogenated materials to meet the for demanding high temperature with the task of achieving an things. industry’s increased performance printed circuit applications. optimal balance between cost and electronic devices. demands for eco-friendly designs. performance when selecting base materials. 4 5 isola-group.com PRODUCTS TERRAGREEN® 400G2 Halogen-Free, Extremely Low Loss Material TerraGreen® 400G2 laminate materials are our most advanced ultra-high speed, halogen-free extremely-low loss design solution. PRODUCT AVAILABILITY TerraGreen® 400G2 is our halogen-free material solution Standard Material Offering: Laminate for next generation 5G infrastructure, data center sys- • 2 to 10 mil (0.05 to 0.25 mm) tems, high end computing, wired & wireless communi- Copper Foil Type cations and AI applications. Our novel resin system, using • HLVP3 (VLP1) ≤1.1 micron Rz JIS ultra smooth HVLP3 (VLP1) copper foil and 2nd genera- Copper Weight tion ultra low Dk glass has been engineered for very high • ½, 1 oz (18 and 35 μm) available data rates of >100 Gb/s with excellent cost for loss perfor- • Thinner copper foil available mance. Standard Material Offering: Prepreg • Tooling of prepreg panels available The TerraGreen 400G2 resin system has proven superior • Moisture barrier packaging CAF performance on tight pitch testing. CAF performance Glass Fabric Availability is enhanced by the resin systems excellent interlaminar and • Ultra Low Dk glass bond line adhesion strength. • Mechanically spread glass • Square weave glass TerraGreen 400G2 is lead free compatible and sequential • Mechanically spread glass lamination capable and can be processed utilizing stan- dard PCB equipment and processing steps. TerraGreen 400G2 meets UL94 V-0. Tachyon VLP2 TerraGreen VLP2 I-TERA MT40 VLP2 I-Speed VLP2 CAF Resistance Data - MRTV I-Speed-IS Insertion Loss Over Frequency 0.0 1.E+14 TerraGreen 400G2 VLP1 1.E+12 TerraGreen 400G VLP1 -0.5 TerraGreen 400GE VLP1 -0.5 Tachyon 100G VLP2 1.E+10 TerraGreen 400GE VLP2 -1.0 1.E+08 -1.0 -1.5 1.E+06 Symmetric Stripline Example PREPREG HOLE O -2.0 1.E+04 -1.5 COPPER HW - HW LAMINATE HIGH SPEED -2.5 1.E+02 Hole Diameter 0.90 mm Copper Foil 1/2 Oz Hole Wall to Wall 0.40 mm Prepreg Thickness 5 mils -2.0 PCB Thickness 3.3 mm Laminate Thickness 5 mils 1.E+00 Line Width Tuned to 50 Ohms 2 4 6 8 10 12 14 16 -3.0 0 200 400 Frequency -GHz 600 800 1000 0 20 30 40 50 60 70 DIGITAL Time @ 65C/87%/100V (hours) Frequency [GHz} TYPICAL PEEL MOISTURE Tg Td T-260 T-288 Dk Df UL CTI STRENGTH ABSORPTION Isola offers a wide range of High-speed Digital (HSD) materials that °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC UL CLASS deliver superior performance and CAF resistance. These low-loss 200 380 ≥60 ≥60 3.10 3.10 0.0015 0.0015 4.10 <0.1 140 2 materials are targeted for applications that require high reliability and signal integrity. Isola also offers halogen-free HSD materials for green electronics. MARKETS ATTRIBUTES 6 7 isola-group.com TERRAGREEN® 400G TERRAGREEN® 400GE Halogen-Free, Extremely Low Loss Laminate and Prepreg Halogen-Free, Ultra Low Loss Material TerraGreen® 400G laminate materials are our most advanced ultra high TerraGreen® 400GE laminate materials are our most advanced ultra-high speed, extremely low loss design solution. speed, halogen-free ultra-low loss design solution. PRODUCT AVAILABILITY PRODUCT AVAILABILITY TerraGreen® 400G is our halogen-free material solution Standard Material Offering: Laminate TerraGreen® 400GE is our halogen-free material solution Standard Material Offering: Laminate for next generation 5G infrastructure, data center sys- • 2 to 10 mil (0.05 to 0.25 mm) for next generation 5G infrastructure, data center sys- • 2 to 10 mil (0.05 to 0.25 mm) tems, high end computing, wired & wireless communi- Copper Foil Type tems, high end computing, wired & wireless communica- Copper Foil Type cations and AI applications. Our novel resin system using • HLVP3 (VLP1) ≤1.1 micron Rz JIS tions with data rates >100 Gb/s. Our novel resin system • HVLP3 (VLP1) ≤1.1 micron Rz JIS • Advanced RTF ≤2.1 micron Rz JIS using RTF3 (<2.5 µm Rz JIS) copper foil and e-glass is our • Advanced RTF ≤2.1 micron Rz JIS ultra smooth HVLP3 (VLP1) copper foil and Low Dk glass has been engineered for very high data rates of >100 • Copper Weight lowest cost member of the TerraGreen® 400G family of • Copper Weight • ½, 1 and 2 oz (18, 35 and 70 μm) available products. • ½, 1 and 2 oz (18, 35 and 70 µm) available Gb/s with excellent cost for loss performance. • Thinner copper foil available • Thinner copper foil available Standard Material Offering: Prepreg The TerraGreen 400GE resin system has proven superior Standard Material Offering: Prepreg The TerraGreen 400G resin system has proven superior • Tooling of prepreg panels available • Tooling of prepreg panels available CAF performance on tight pitch testing. CAF performance CAF performance on tight pitch testing. CAF performance • Moisture barrier packaging • Moisture barrier packaging is enhanced by the resin systems excellent interlaminar is enhanced by the resin systems excellent interlaminar Glass Fabric Availability Glass Fabric Availability and bond line adhesion strength. TerraGreen 400G is and bond line adhesion strength. • E-glass • Low Dk glass lead free compatible and sequential lamination capable • Square weave glass • Square weave glass and can be processed utilizing standard PCB equipment • Mechanically spread glass TerraGreen 400GE is lead free compatible and sequential • Mechanically spread glass and processing steps. TerraGreen 400G meets UL94 V-0. lamination capable and can be processed utilizing stan- dard PCB equipment and processing steps. TerraGreen Tachyon VLP2 400GE meets UL94 V-0. Tachyon VLP2 TerraGreen VLP2 TerraGreen VLP2 I-TERA MT40 VLP2 I-TERA MT40 VLP2 I-Speed VLP2 Insertion Loss Over Frequency CAF Resistance Data - MRTV I-Speed VLP2 Insertion Loss Over Frequency CAF Resistance Data - MRTV I-Speed-IS I-Speed-IS 0.0 1.E+14 0.01.E+14 TerraGreen 400G2 VLP1 TerraGreen 400G2 VLP1 1.E+12 1.E+12 TerraGreen 400G VLP1 TerraGreen 400G VLP1 -0.5 -0.5 TerraGreen 400GE VLP1 TerraGreen 400GE VLP1 Tachyon 100G VLP2 Tachyon 100G VLP2 -0.5 -0.51.E+10 TerraGreen 400GE VLP2 1.E+10 TerraGreen 400GE VLP2 -1.0 -1.0 1.E+08 1.E+08 -1.0 -1.0 -1.5 -1.5 Symmetric Stripline Example 1.E+06 Symmetric Stripline Example 1.E+06 PREPREG PREPREG -2.0 HOLE O -2.0 HOLE O 1.E+04 COPPER 1.E+04 COPPER -1.5 -1.5 LAMINATE HW - HW LAMINATE HW - HW -2.5 -2.5 1.E+02 Copper Foil 1/2 Oz 1.E+02 Hole Diameter 0.90 mm Copper Foil 1/2 Oz Hole Diameter 0.90 mm Prepreg Thickness 5 mils Hole Wall to Wall 0.40 mm Prepreg Thickness 5 mils Hole Wall to Wall 0.40 mm Laminate Thickness 5 mils -2.0 PCB Thickness 3.3 mm Laminate Thickness 5 mils PCB Thickness 3.3 mm -2.0 Line Width Tuned to 50 Ohms -3.0 Line Width Tuned to 50 Ohms 1.E+00 -3.0 1.E+00 2 4 6 8 10 12 14 16 2 4 6 8 10 12 14 16 0 1000 0 20 30 40 50 60 70 0 Frequency -GHz 1000 0 20 30 40 50 60 70 200 400 -GHz Frequency 600 800 200 400 600 800 Time @ 65C/87%/100V (hours) Frequency [GHz} Time @ 65C/87%/100V (hours) Frequency [GHz} TYPICAL PEEL MOISTURE TYPICAL PEEL MOISTURE Tg Td T-260 T-288 Dk Df UL CTI Tg Td T-260 T-288 Dk Df UL CTI STRENGTH ABSORPTION STRENGTH ABSORPTION UL UL °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS CLASS 200 380 ≥60 ≥60 3.15 3.15 0.0017 0.0017 4.10 <0.1 140 2 200 380 ≥60 ≥60 3.29 3.29 0.0026 0.0026 4.10 <0.1 140 2 MARKETS ATTRIBUTES MARKETS ATTRIBUTES I-Tera® MT40 laminate materials exhibit exceptional electrical properties which are very stable over a broad frequency and temperature range. 8 9 isola-group.com TACHYON® 100G I-TERA® MT40 Ultra Low Loss Laminate and Prepreg Very Low Loss Laminate and Prepreg Tachyon® 100G laminate materials are designed for very high-speed digital applications up to and beyond data rates of 100 Gb/s. PRODUCT AVAILABILITY PRODUCT AVAILABILITY Standard Material Offering: Laminate Standard Material Offering: Laminate Tachyon® 100G materials exhibit exceptional electrical • 2 to 20 mil (0.05 to 0.50 mm) I-Tera® MT40 is suitable for many of today’s high speed • 2 to 24 mil (0.05 to 0.61 mm) properties that are very stable over a broad frequency digital and RF/microwave printed circuit designs. I-Tera Copper Foil Type Copper Foil Type and temperature range between -55°C and +125°C up to • HLVP3 (VLP1) ≤1.1 micron Rz JIS MT40 features a dielectric constant (Dk) that is stable be- • HVLP (VLP2) ≤2.5 micron Rz JIS 100 GHz. These electrical properties provide designers • HVLP (VLP2) ≤2.5 micron Rz JIS tween -55°C and +125°C up to W-band frequencies. In • Advanced RTF ≤2.1 micron Rz JIS a scalable solution for next generation designs of back- • Advanced RTF ≤2.1 micron Rz JIS addition, I-Tera MT40 offers a lower dissipation factor (Df) • RTF (Reverse Treat Foil) • Embedded resistor foil • Embedded resistor foil planes and daughter cards, enabling 10x improvements of 0.0031 making it a cost effective alternative to PTFE from 10 Gb/s data rates. Copper Weight and other commercial microwave and high-speed digital Copper Weight • ½, 1 and 2 oz (18, 35 and 70 μm) available • ½ to 2 oz (18, 35 and 70 μm) is standard • Heavier copper foil available laminate materials. • Heavier copper foil available Isola has developed Tachyon 100G with the highest level • Thinner copper foil available • Thinner copper foil available of thermal performance for high layer count line cards. Standard Material Offering: Prepreg I-Tera MT40 laminate materials are currently being offered Standard Material Offering: Prepreg The very low Z-axis CTE makes it a perfect choice for fine • Moisture barrier packaging in both laminate and prepreg form in typical thicknesses • Tooling of prepreg panels pitch BGA applications. The material is optimized with the • Tooling of prepreg panels available and standard panel sizes. This provides a complete ma- • Moisture barrier packaging use of spread glass to mitigate skew, improve rise times, Glass Fabric Availability terials solution package for high-speed digital multilayer, Glass Fabric Availability reduce jitter, and increase eye width/height and that use • Low Dk Glass hybrid, RF/microwave, multilayer and double-sided print- • E-glass • Square weave glass ed circuit designs. I-Tera MT40 does not require any spe- ultra smooth HVLP (VLP2) 2um Rz copper that significant- • Square weave glass • Mechanically spread glass • Mechanically spread glass ly reduces conductor losses. cial through hole treatments commonly needed when Tachyon VLP2 TerraGreen VLP2 processing PTFE-based laminate materials. Tachyon VLP2 I-TERA MT40 VLP2 TerraGreen VLP2 I-Speed VLP2 I-TERA MT40 VLP2 CAF Resistance Data - MRTV I-Speed-IS Insertion Loss Over Frequency CAF Resistance Data - MRTV I-Speed VLP2 Insertion Loss Over Frequency 0.0 0.4mm H-H MRT6 TV After Reflow I-Speed-IS 1.E+14 0.0 1.E+14 Tachyon 100G VLP2 TerraGreen 400G2 VLP1 1.E+12 1.E+12 -0.5 TerraGreen IS580G VLP2 ARTF TerraGreen 400G VLP1 -0.5 I-Tera MT40 VLP2 -0.5 TerraGreen 400GE VLP1 I-Speed VLP2 Tachyon 100G VLP2 -0.5 -1.0 1.E+10 TerraGreen 400GE VLP2 1.E+10 -1.0 -1.5 1.E+08 1.E+08 -1.0 -1.0 -1.5 -2.0 1.E+06 Symmetric Stripline Example 1.E+06 Symmetric Stripline Example -2.5 PREPREG PREPREG HOLE O HOLE O -1.5 -2.0 1.E+04 COPPER 1.E+04 -1.5 COPPER HW - HW LAMINATE HW - HW -3.0 LAMINATE 1.E+02 -2.5 1.E+02 Hole Diameter 0.90 mm Copper Foil 1/2 Oz Hole Diameter 0.90 mm -3.5 Copper Foil 1/2 Oz -2.0 Hole Wall to Wall 0.40 mm Prepreg Thickness 5 mils Hole Wall to Wall 0.40 mm Prepreg Thickness 5 mils 2 4 6 8 10 PCB Thickness 12 14 3.3 mm 16 Laminate Thickness 5 mils -2.0 PCB Thickness 3.3 mm Laminate Thickness 5 mils 1.E+00 Line Width Tuned to 50 Ohms 1.E+00 Line Width Tuned to 50 Ohms Frequency -GHz -3.0 2 4 6 8 10 12 14 16 -4.0 0 200 400 600 800 1000 0 20 30 40 50 60 70 0 200 Frequency -GHz 600 400 800 1000 0 20 30 40 50 60 70 Time @ 65C/87%/100V (hours) Frequency [GHz} Time @ 65C/87%/100V (hours) Frequency [GHz} TYPICAL PEEL MOISTURE TYPICAL PEEL MOISTURE Tg Td T-260 T-288 Dk Df UL CTI Tg Td T-260 T-288 Dk Df UL CTI STRENGTH ABSORPTION 1100 STRENGTH ABSORPTION UL UL °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS 215 360 ≥60 ≥60 3.04 3.02 0.0021 0.0021 5.50 <0.1 130 3 215 360 ≥60 ≥60 3.45 3.45 0.0031 0.0031 5.70 <0.1 130 3 MARKETS ATTRIBUTES MARKETS ATTRIBUTES 10 11 isola-group.com IS580G I-SPEED® Halogen-Free, Very Low Loss Material Low Loss, Epoxy Laminate and Prepreg IS580G is a halogen-free 195°C Tg resin system for multilayer PWB applications I-Speed® is a 180°C Tg FR-4 resin system for multilayer PWB applications where maximum thermal performance and reliability are required. where maximum thermal performance and reliability are required. PRODUCT AVAILABILITY PRODUCT AVAILABILITY IS580G laminate and prepreg products are manufactured Standard Material Offering: Laminate I-Speed® laminate and prepreg products are man- Standard Material Offering: Laminate with Isola’s high performance, low loss, multi-functional • 2 to 30 mil (0.05 to 0.75 mm) ufactured with Isola’s patentable high performance • 2 to 28 mil (0.05 to 0.71 mm) resin system, reinforced with electrical grade (e-glass) Copper Foil Type multi-functional resin system, reinforced with electrical Copper Foil Type glass fabric. The unique resin system delivers a >25% • Advanced RTF ≤2.5 micron Rz JIS grade (e-glass) glass fabric. This system delivers a low • HTE Grade 3 • HVLP (VLP2) ≤2.5 micron Rz JIS improvement in Z-axis expansion while maintaining good Copper Weight Z-axis expansion and offers 25% reduction in loss com- • RTF (Reverse Treat Foil) flow and fill properties. These properties, coupled with • ½, 1 and 2 oz (18, 35 and 70 μm) available pared to our mid-loss products. These properties cou- • Embedded resistor foil superior moisture resistance at reflow, result in a halo- Standard Material Offering: Prepreg pled with superior moisture resistance at reflow, result in Copper Weight gen-free product with an industry-leading combination of • Roll or panel form a product that bridges the gap from both a thermal and • ½ to 2 oz (18,35 and 70 μm) is standard • Moisture barrier packaging • Heavier copper foil available thermal and electrical performance. electrical perspective. • Tooling of prepreg panels • Thinner copper foil available Glass Fabric Availability The I-Speed resin system is laser fluorescing and UV Standard Material Offering: Prepreg • E-glass • Tooling of prepreg panels • Square weave glass blocking for maximum compatibility with Automated Op- • Moisture barrier packaging • Mechanically spread glass tical Inspection (AOI) systems, optical positioning sys- Glass Fabric Availability tems and photo imagable solder mask imaging. • E-glass • Square weave glass • Mechanically spread glass Tachyon VLP2 TerraGreen VLP2 I-TERA MT40 VLP2 I-Speed VLP2 Caf Resistance Data - MRTV (6xReflow) Insertion Loss Over Frequency CAF Resistance Data - MRTV I-Speed-IS Insertion Loss Over Frequency 0.0 1.E+14 1.E+14 Tachyon 100G VLP2 1.E+12 Tachyon 100G VLP2 1.E+12 -0.5 TerraGreen IS580G VLP2 ARTF -0.5 TerraGreen VLP2 IS580G ARTF I-Tera MT40 VLP2 I-Tera MT40 VLP2 I-Speed VLP2 -0.5 -1.0 I-Speed VLP2 1.E+10 1.E+10 -1.0 -1.5 -1.5 1.E+08 1.E+08 -1.0 -2.0 -2.0 1.E+06 Symmetric Stripline Example 1.E+06 Symmetric Stripline Example -2.5 -2.5 PREPREG PREPREG HOLE O HOLE O 1.E+04 COPPER -1.5 1.E+04 COPPER -3.0 LAMINATE -3.0 HW - HW HW - HW LAMINATE 1.E+02 1.E+02 Hole Diameter 0.90 mm -3.5 Copper Foil 1/2 Oz Hole Diameter 0.90 mm -3.5 Copper Foil 1/2 Oz Hole Wall to Wall 0.40 mm Prepreg Thickness 5 mils Hole Wall to Wall 0.40 mm Prepreg Thickness 5 mils PCB Thickness 3.3 mm Laminate Thickness 5 mils -2.0 PCB Thickness 3.3 mm Laminate Thickness 5 mils 1.E+00 Line Width Tuned to 50 Ohms 6 10 12 14 16 Line Width Tuned to 50 Ohms -4.0 1.E+00 2 4 8 -4.0 0 200 400 600 800 1000 0 20 30 40 50 60 70 0 200 Frequency -GHz 600 400 800 1000 0 20 30 40 50 60 70 Time @ 65C/87%/100V (hours) Frequency [GHz} Time @ 65C/87%/100V (hours) Frequency [GHz} TYPICAL PEEL MOISTURE TYPICAL PEEL MOISTURE Tg Td T-260 T-288 Dk Df UL CTI Tg Td T-260 T-288 Dk Df UL CTI STRENGTH (HTE) ABSORPTION 1100 STRENGTH ABSORPTION UL UL °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS 195 385 ≥60 ≥60 3.80 3.80 0.006 0.006 4.30 <0.1 160 2 180 360 >60 ≥60 3.64 3.63 0.0059 0.0060 5.50 <0.06 130 2 MARKETS ATTRIBUTES MARKETS ATTRIBUTES 12 13 isola-group.com PRODUCTS ASTRA®MT77 Ultra Low Loss Laminate and Prepreg Astra® MT77 materials are a breakthrough, very low-loss dielectric constant (Dk) product for millimeter wave frequencies and beyond. PRODUCT AVAILABILITY Astra® MT77 laminate materials exhibit exceptional electri- Standard Material Offering: Laminate cal properties which are very stable over a broad frequency • 2.5, 5, 7.5, 10, 12.5, 15, 20, 30, 60 mil ( 0.0635, 0.127, 0.1905, 0.254, 0.3175, 0.381, 0.510, 0.760, 1.50 mm) and temperature range. Astra MT77 is suitable for many of today’s commercial RF/microwave printed circuit designs. Copper Foil Type It features a dielectric constant (Dk) that is stable between • HVLP (VLP2) ≤2.5 micron Rz JIS • Embedded resistor foil -40°C and +140°C at up to W-band frequencies. In addi- tion, Astra MT77 offers an ultra-low dissipation factor (Df) Copper Weight • ½ to 2 oz (18,35 and 70 µm) is standard of 0.0017, making it a cost-effective alternative to PTFE and • Thinner copper foil available other commercial microwave laminate materials. Standard Material Offering: Prepreg • Tooling of prepreg panels Key applications include long antennas and radar applica- • Moisture barrier packaging tions for automobiles, such as adaptive cruise control, pre- crash, blind spot detection, lane departure warning and stop and go systems. Astra MT77 Astra MT77 Very Low Loss Product 1Very Low Loss Produ Permittivity @60GHz Permittivity @60GHz Insertion Loss Over Frequency Insertion Loss Over Frequency Very Low Loss Product 2Very Low Loss Produ Competing PTFE Product Competing PTFE Pro 0.0 0.0 Astra MT77 Very Low Loss Product 1 Permittivity @60GHz Insertion Loss Over Frequency Very Low Loss Product 2 Competing PTFE Product 0.0 -0.6 -0.6 -1.2 -1.2 -0.6 -1.2 -1.8 -1.8 Surface Microstrip Example COPPER -2.4 -2.4 RADIO FREQUENCY -1.8 Copper Foil 1/3 oz Laminate Thickness 5 mils Line Width Tuned to 50 Ohms -3.0 -3.0 25 2575 75 125 125150 150 -2.4 0 0 20 2040 4060 6080 80 & MICROWAVE Temperature [ºC] Temperature [ºC] Frequency [GHz} Frequency [GHz} -3.0 TYPICAL PEEL MOISTURE 25 Tg75 Td 125 T-260 T-288 150 Dk 0 Df 20 40 60 UL80 CTI STRENGTH ABSORPTION Temperature [ºC] Frequency [GHz} UL °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS Today’s RF/Microwave and Millimeter Wave designers are challenged more than ever with the task of achieving an optimal 200 360 ≥60 ≥60 3.00 3.00 0.0017 0.0017 5.70 <0.1 130 3 balance between cost and performance when selecting base materials. MARKETS ATTRIBUTES 14 15 isola-group.com I-TERA® MT40 (RF/MW) PRODUCTS Very Low Loss Laminate I-Tera® MT40 laminate materials exhibit exceptional electrical properties which are very stable over a broad frequency and temperature range. PRODUCT AVAILABILITY I-Tera® MT40 is suitable for many of today’s high speed Standard Material Offering: Laminate digital and RF/microwave printed circuit designs. I-Tera • 5, 10, 20, 30, 40, 60 mil (0.13, 0.25, 0.51, 0.76, 1.02, 1.5 mm) MT40 features a dielectric constant (Dk) that is stable be- tween -40°C and +140°C up to W-band frequencies. In Copper Foil Type • HTE Grade 3 addition, I-Tera MT40 offers a very low dissipation factor • HVLP (VLP2) ≤2.5 micron Rz JIS (Df) of 0.0028 - 0.0035 making it a cost effective alterna- • Advanced RTF ≤2.1 micron Rz JIS tive to PTFE and other commercial microwave and high- • RTF (Reverse Treat Foil) speed digital laminate materials. • Embedded resistor foil Copper Weight • ½ to 2 oz (18,35 and 70 μm) is standard I-Tera MT40 laminate materials are currently being offered • Thinner copper foil available in both laminate and prepreg form in typical thicknesses Glass Fabric Availability and standard panel sizes. This provides a complete ma- • Square weave glass terials solution package for high-speed digital multilayer, • Mechanically spread glass hybrid, RF/microwave, multilayer and double-sided print- ed circuit designs. I-Tera MT40 does not require any spe- cial through hole treatments commonly needed when processing PTFE-based laminate materials. Permittivity @60GHz Permittivity @60GHz Insertion Insertion Loss Over Loss Over Frequency Frequency I-TERA MT40 I-TERA MT40 Very Low Loss Product Very Low Loss Product 0.0 0.0 3.5 @60GHz Insertion Loss Over Frequency I-TERA MT40 Very Low Loss Product 0.0 3.48 -0.6 -0.6 -0.6 3.46 -1.2 -1.2 S21[dB/in] -1.2 3.44 -1.8 -1.8 Surface Microstrip Example HIGH THERMAL -1.8 COPPER 3.42 -2.4 -2.4 Copper Foil 1/3 oz -2.4 Laminate Thickness 5 mils Line Width Tuned to 50 Ohms RELIABILITY 3.4 -3.0 -3.0 25 25 75 75 125 125 150 150 0 200 4020 6040 80 60 80 Temperature [ºC] Temperature [ºC] Frequency [GHz} Frequency [GHz} -3.0 75 125 150 0 20 40 60 80 Temperature [ºC] TYPICAL[GHz} Frequency PEEL MOISTURE Tg Td T-260 T-288 Dk Df UL CTI STRENGTH (HTE) ABSORPTION °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC UL Thermal reliability requirements can be separated into two cat- CLASS egories. The first involves survival of a PCB through assembly 3.38, 3.45, 3.38, 3.45, 0.0028 to 0.0028 to 215 360 ≥60 ≥60 3.60, 3.75 3.60, 3.75 0.0035 0.0035 5.7 <0.1 130 3 without defects such as blisters or delamination. The second category involves thermal reliability in the operating environ- MARKETS ATTRIBUTES ment over a product’s lifetime. Both types of thermal reliability are critical. 16 17 isola-group.com isola-group.com 14 IS550H 370HR High Reliability Laminate and Prepreg Industry Leading Epoxy Laminate and Prepreg IS550H is our halogen-free laminate solution for high power & voltage 370HR is the industry’s “best in class” lead-free compatible product for high- applications that require extreme thermal stability. reliability applications across a wide range of markets. PRODUCT AVAILABILITY PRODUCT AVAILABILITY IS550H was developed in conjunction with a consortium Standard Material Offering: Laminate 370HR laminates and prepregs, designed by Polyclad, are Standard Material Offering: Laminate of industry experts for high power & high voltage applica- • 2 to 59 mil (0.05 to 1.5 mm) made using a patented high performance 180°C Tg FR-4 • 2 to 125 mil (0.05 to 3.2 mm) tions and PEV & HEV automotive electrification. The re- Copper Foil Type multifunctional epoxy resin system that is designed for Copper Foil Type sulting solution addresses critical application needs for • HTE Grade 3 multilayer Printed Wiring Board (PWB) applications where • HTE Grade 3 • RTF (Reverse Treat Foil) • RTF (Reverse Treat Foil) use in a harsh environment where very demanding, long maximum thermal performance and reliability are required. Copper Weight • Embedded resistor foil term thermal reliability performance, extreme thermal We manufacture 370HR laminates and prepregs with high • ½, 1 and 2 oz (18, 35 and 70 μm) is standard Copper Weight cycling and very high voltage CAF & electro-migration re- • Heavier copper available quality E-glass glass fabric for superior Conductive Anodic • ½ to 2 oz (18,35 and 70 µm) is standard sistance are required. Standard Material Offering: Prepreg Filament (CAF) resistance. 370HR provides superior ther- • Heavier copper available • Tooling of prepreg panels mal performance with low Coefficient of Thermal Expan- • Thinner copper foil available • Moisture barrier packaging sion (CTE) and the mechanical, chemical and moisture re- Standard Material Offering: Prepreg Glass Fabric Availability sistance properties that equal or exceed the performance • Tooling of prepreg panels • E-glass of traditional FR-4 materials. • Moisture barrier packaging • Square weave glass Glass Fabric Availability • Mechanically spread glass 370HR is used in thousands of PWB designs and has proven • E-glass to be best in class for thermal reliability, CAF performance, • Square weave glass • Mechanically spread glass ease of processing and proven performance on sequential Tachyon VLP2 lamination designs. Tachyon VLP2 TerraGreen VLP2 TerraGreen VLP2 I-TERA MT40 VLP2 I-TERA MT40 VLP2 I-Speed VLP2 CAF Resistance Data - MRTV I-Speed-IS CAF Resistance Data - MRTV I-Speed VLP2 I-Speed-IS 0.4mm H-H MRT6 TV After Reflow Insertion Loss Over Frequency 0.0 0.0 0.4mm H-H MRT6 TV After Reflow I-TERA MT40 1.E+14 Very Low Loss Product 1.E+14 0.0 1.E+12 1.E+12 -0.5 -0.5 -0.6 1.E+10 1.E+10 1.E+08 -1.0 1.E+08 -1.2 -1.0 1.E+06 1.E+06 -1.8 HOLE O HOLE O -1.5 1.E+04 -1.5 1.E+04 HW - HW HW - HW -2.4 1.E+02 Hole Diameter 0.90 mm 1.E+02 Hole Diameter 0.90 mm Hole Wall to Wall 0.40 mm -2.0 PCB Thickness 3.3 mm -2.0 Hole Wall to Wall 0.40 mm 10 12 PCB Thickness 3.3 mm 1.E+002 4 6 8 14 16 6 8 10 12 14 16 1.E+00 2 4 -3.0 -100 200 Frequency 500 -GHz 800 1100 1300 Frequency -GHz -100 100 300 500 700 900 0 20 40 60 80 Time @ 85C/85%/100V (hours) Time @ 65C/87%/100V (hours) Frequency [GHz} TYPICAL PEEL MOISTURE TYPICAL PEEL MOISTURE Tg Td T-260 T-288 Dk Df UL CTI Tg Td T-260 T-288 Dk Df UL CTI STRENGTH (HTE) ABSORPTION STRENGTH (HTE) ABSORPTION UL UL °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC °C °C min min 2GHz 10GHz 2GHz 10GHz LB/IN % RTI oC CLASS CLASS 200 400 ≥60 ≥60 4.50 4.43 0.014 0.016 8.2 <0.25 150 3 180 340 ≥60 ≥30 4.04 3.92 0.021 0.025 7.00 <0.15 130 3 MARKETS ATTRIBUTES MARKETS ATTRIBUTES 18 19 isola-group.com Tg Td T-260 T-288 Z-Axis CTE Dk Df UL CTI ATTRIBUTES PCB LAMINATE & HALOGEN FREE TYPICAL PEEL MOISUTRE UL CLASS PREPREG STRENGTHS TERRAGREEN® 400G RF/MW ABSORPTION Pre-Tg Post-Tg 50 to Extremely Low Loss PPM/ PPM/ 260 oC RTI Material o C o C min min o C o C % 2GHz 10GHz 2GHz 10GHz o C ASTRA® MT77 Tg: 210°C Dk: 3.15 TERRAGREEN® 400G RF/MW ● 210 400 ≥60 ≥60 37 170 3.1 3.15 3.15 0.0018 0.0018 3.5 0.10% 130 2 MATERIALS Ultra Low Loss, RF/MW Td: 400°C Df: 0.0018 Laminate and Prepreg 3.38 to 3.38 to 0.0028 to 0.0028 to RF/MICROWAVE I-TERA® MT40 (RF/MW) 215 360 ≥60 ≥60 55 290 2.8 5.7 0.10% 130 3 3.75 3.75 0.0035 0.0035 Tg: 200°C Dk: 3.00 Isola high-performance lami- I-TERA® MT40 (RF/MW) ASTRA® MT77 200 360 ≥60 ≥60 50-70 250-350 2.25-3.15 3.00 3.00 0.0017 0.0017 5.7 0.10% 130 3 Very Low Loss Material Td: 360°C Df: 0.0017 nate products feature propri- FR408HR 190 360 ≥60 >30 55 230 2.8 3.68 3.65 0.0092 0.0095 5.5 0.06% 130 2 etary resin formulations that Tg: 215°C Dk: 3.38/3.45/3.60/3.75 Td: 360°C Df: 0.0028 - 0.0035 I-SPEED® 180 360 ≥60 ≥60 60 230 2.7 3.64 3.63 0.0059 0.006 5.5 0.06% 130 2 are engineered to meet your design specifications and ex- IS580G ● 195 385 ≥60 ≥60 30 190 1.8 3.80 3.80 0.006 0.006 4.3 0.05% 160 2 ceed your expectations. I-TERA® MT40 215 360 ≥60 ≥60 55 290 2.8 3.45 3.45 0.0031 0.0031 5.7 0.10% 130 3 HIGH SPEED TERRAGREEN® 400G2 DIGITAL Extremely Low Loss TACHYON® 100G 215 360 ≥60 ≥60 45 250 2.5 3.04 3.02 0.0021 0.0021 5.5 0.10% 130 3 Laminate and Prepreg Tg: 200°C Dk: 3.10 TERRAGREEN® 400G ● 200 380 ≥60 ≥60 37 170 1.8 3.15 3.15 0.0017 0.0017 4.1 0.10% 140 2 TACHYON® 100G Very Low Loss Td: 380°C Df: 0.0015 Laminate and Prepreg TERRAGREEN® 400GE ● 200 380 ≥60 ≥60 37 170 1.8 3.29 3.29 0.0026 0.0026 4.1 0.10% 140 2 Tg: 215°C Dk: 3.02 TERRAGREEN® 400G2 ● 200 380 ≥60 ≥60 37 170 1.8 3.10 3.10 0.0015 0.0015 4.1 0.10% 140 2 I-TERA® MT40 Very Low Loss Td: 360°C Df: 0.0021 Laminate and Prepreg IS400 150 330 ≥60 >10 50 250 3.3 3.90 3.80 0.021 0.026 9.0 0.18% 130 3 Tg: 215°C Dk: 3.45 I-SPEED ® TERRAGREEN® 400G 185HR 180 340 ≥60 >15 40 220 2.7 4.01 3.88 0.020 0.024 4.5 0.15% 130 3 Low Loss, Epoxy Td: 360°C Df: 0.0031 THERMAL Extremely Low Loss Laminate and Prepreg Laminate and Prepreg RELIABILITY 370HR 180 340 ≥60 ≥30 45 230 2.8 4.04 3.92 0.021 0.025 7.0 0.15% 130 3 Tg: 180°C Dk: 3.64 Tg: 200°C Dk: 3.10 TERRAGREEN 400GE® Td: 360°C Df: 0.0060 Extremely Low Loss Td: 380°C Df: 0.0018 IS550H ● 200 400 ≥60 ≥60 38 210 2.0 4.50 4.43 0.014 0.016 8.2 0.25% 150 3 Laminate and Prepreg P95/P25 260 416 ≥60 ≥60 55 N/A 1.5 3.76 3.73 0.018 0.021 7.0 0.50% 170 2 Tg: 200°C Dk: 3.29 SPECIALTY IS580G PRODUCTS Very Low Loss Material Td: 380°C Df: 0.0026 P96/P26 260 396 ≥60 ≥60 55 N/A 1.5 3.76 3.73 0.018 0.021 7.0 0.50% 170 4 Tg: 195°C Dk: 3.80 FR408HR Lead Free, Mid Loss Td: 385°C Df: 0.0060 Laminate and Prepreg ACCORDING TO ACCORDING TO Tg: 190°C Dk: 3.68 Td: 360°C Df: 0.0092 IPC-4101 /40 /41 /97 /98 /99 /101 /102 /126 /129 /134 /140 IPC-4103 /17 IS550H Low CTE, Very High Thermal IS400 ● ● ● ● IS580G® ● Reliability Laminate and Prepreg THERMAL 185HR ● ● ● ● 185HR Tg: 200°C Dk: 4.43 RELIABLE Standard Loss, Thermally Robust 370HR ● ● ● ● HIGH SPEED DIGITAL I-TERA® MT40 ● Td: 400°C Df: 0.016 NO FLOW HIGH TEMPERATURE Epoxy Laminate and Prepreg IS550H ● FR406N P95/P25 Tg: 180°C Dk: 4.01 TACHYON® 100G ● No-Flo® and Lo-Flo® Polyimide UL HB Td: 340°C Df: 0.020 FR408HR ● ● ● ● Specialty Prepreg Laminate and Prepreg I-SPEED® ● ● ● ● Tg: 170°C Dk: 4.3 Tg: 260°C Dk: 3.76 I-TERA® MT40 (RF/MW) ● Td: 300°C Df: 0.025 Td: 416°C Df: 0.017 370HR IS580G ● Standard Loss, Thermally Robust RF/MICROWAVE Epoxy Laminate and Prepreg I-TERA® MT40 ● HIGH SPEED ASTRA® MT77 ● Tg: 180°C Dk: 4.04 DIGITAL IS400 TACHYON® 100G ● Lead Free, Mid Tg Epoxy Td: 340°C Df: 0.021 Laminate and Prepreg TERRAGREEN® 400GE ● P25N P96/26 Polyimide UL HB No Flow Polyimide UL V-0 Tg: 150°C Dk: 3.90 TERRAGREEN® 400G ● Prepreg Laminate and Prepreg Td: 330°C Df: 0.022 TERRAGREEN 400G2 ® ● Tg: 250°C Dk: 3.67 Tg: 260°C Dk: 3.76 EXPLORE Td: 383°C Df: 0.018 Td: 396°C Df: 0.017 SPECIALTY P95/P25 ● ● MORE PRODUCTS P96/P26 ● ● 20 21 isola-group.com STACKUPS NETWORK CONTACT US Buidling hybrid stackups is easy with Whether you’re just figuring out what you North American Global Headquarters Isola laminate & prepreg materials. need or you’re ready to start building, 6565 West Frye Road Chandler, AZ 85226 we’re here to collaborate and get your 480-893-6527 amer.customer.service@isola-group.com product to market fast. High Speed Digital + RF/ Microwave European Regional Headquarters parts of I-Tera® MT40 OUR REACH Isolastrasse 2 D-52353 Düren, Germany 49-2421-8080 emea.customer.service@isola-group.com Tachyon® 100G + I-Tera® MT40 Asia Pacific Regional Headquarters Mix Astra® MT77, I-Tera® MT40, 12/F, Kin Sang Commercial Centre, Tachyon® 100G, materials with 49 King Yip Street, Kwun Tong, Kowloon, Hong Kong 370HR 852-2418-1318 apac.customer.service@isola-group.com 22 23 isola-group.com PRODUCT GUIDE 2025 isola-group.com Isola, the Isola logo, Astra®, I-Speed®, I-Tera®, Tachyon®, TerraGreen®, and The Base for Innovation are registered trademarks or trademarks of ISOLA USA Corp. in the United States and in Revisions: A: Initial release - 1/23 other countries. Copyright © 2023 B: \u0007NEW Products - TerraGreen® Isola Group. All rights reserved. 400G2, TerraGreen® 400GE, 580G - 1/24 C: Corrected Typos - 1/25 24"
  }
]